/* 
problem -1
একটা ফর লুপ চালাও। ৩০ থেকে ৮৬ পর্যন্ত। আর এই লুপ ৪৪ এ গেলে ব্রেক করবে। সেই জিনিস কোড করে দেখাও 

*/
for(i = 30; i <= 86; i++){
    if(i === 44){
       
        break;
       
    }
    // console.log(i);
}

/* 
problem-2 
তোমার যত বই আছে সেগুলার দাম নিয়ে একটা array লিখে ফেলো। যে বই গুলোর দাম ২০০ টাকার উপরে সেগুলাকে স্কিপ করবে। অর্থাৎ সেগুলাকে আউটপুট হিসেবে দেখাবে না। বাকিদের কে আউটপুট হিসেবে দেখাবে। দেখো করতে পারো কিনা। 

*/
let bookPrice = [150, 125, 200, 800, 50, 89, 156, 46, 201, 145, 260, 180, 268];

for(i = 0; i < bookPrice.length; i++){
    // let price = bookPrice[i]
    if( bookPrice[i] > 200){
        continue;
    }
    console.log(bookPrice[i]);
}